

Веб-сайт с графом всех исторических событий (в том числе сегодняшних) (с любыми деталями) (связи последовательно-исторические, причинно-следственные, просто ссылки на другие события). ИИ может блуждать по этому графу и размечать кто оказался прав и кто не прав, изменять рейтинг личностей/обществ.

Будет как аналог новостного сайта, аргумент в спорах, будет помогать выбирать, кому можно верить, а кому нельзя.
Достаточно взглянуть на граф, вместо того чтобы открывать кучи статей и искать какая на какую ссылается, чтобы посмотреть всю цепочку событий.
